// 例程中单片机晶振采用11.0592MHz，
// 但是我们的电路板上的晶振用的是6MHz，
// 所以整首音乐的音准不对，
// 要改正常的话，需修改FREQH[]和FREQL[]数组里的值
#include <reg51.h>
sbit speaker = P3 ^ 6;
sbit P3_7 = P3 ^ 7;

unsigned char timer0h, timer0l, time;
//--------------------------------------
// 频率-半周期数据表 高八位     本软件共保存了四个八度的28个频率数据
code unsigned char FREQH[] = {
    0xF2, 0xF3, 0xF5, 0xF5, 0xF6, 0xF7, 0xF8,       // 低音1234567
    0xF9, 0xF9, 0xFA, 0xFA, 0xFB, 0xFB, 0xFC, 0xFC, // 1,2,3,4,5,6,7,i
    0xFC, 0xFD, 0xFD, 0xFD, 0xFD, 0xFE,             // 高音 234567
    0xFE, 0xFE, 0xFE, 0xFE, 0xFE, 0xFE, 0xFF};      // 超高音 1234567
// 频率-半周期数据表 低八位
code unsigned char FREQL[] = {
    0x42, 0xC1, 0x17, 0xB6, 0xD0, 0xD1, 0xB6,       // 低音1234567
    0x21, 0xE1, 0x8C, 0xD8, 0x68, 0xE9, 0x5B, 0x8F, // 1,2,3,4,5,6,7,i
    0xEE, 0x44, 0x6B, 0xB4, 0xF4, 0x2D,             // 高音 234567
    0x47, 0x77, 0xA2, 0xB6, 0xDA, 0xFA, 0x16};      // 超高音 1234567
//--------------------------------------
// 世上只有妈妈好数据表           要想演奏不同的乐曲, 只需要修改这个数据表
code unsigned char east_red[] = {
    // 一个音符有三个数字。前为第几个音、中为第几个八度、后为时长（以半拍为单位）。
    // 6, 2, 3 分别代表：６, 中音, ３个半拍;
    // 5, 2, 1 分别代表：５, 中音, １个半拍;
    // 3, 2, 2 分别代表：３, 中音, ２个半拍;
    // 5, 2, 2 分别代表：５, 中音, ２个半拍;
    // 1, 3, 2 分别代表：１, 高音, ２个半拍;
    //
    // 东方红
    5, 2, 2, // 东
    5, 2, 1, // 方
    6, 2, 1,
    2, 2, 4, // 红

    1, 2, 2, // 太
    1, 2, 1, // 阳
    6, 1, 1,
    2, 2, 4, // 升

    5, 2, 2, // 中
    5, 2, 2, // 国
    6, 2, 1, // 出
    1, 3, 1,
    6, 2, 1, // 了
    5, 2, 1, // 个
    1, 2, 2, // 毛
    1, 2, 1, // 泽
    6, 1, 1,
    2, 2, 4, // 东

    5, 2, 2, // 他
    2, 2, 2, // 为
    1, 2, 2, // 人
    7, 1, 1, // 民
    6, 1, 1,
    5, 1, 2, // 谋
    5, 2, 2, // 幸
    2, 2, 2, // 福
    3, 2, 1,
    2, 2, 1,
    1, 2, 3,
    6, 1, 1,
    2, 2, 1, // 他
    3, 2, 1, // 是
    2, 2, 1, // 人
    1, 2, 2, // 民
    2, 2, 1, // 大
    1, 2, 2,
    7, 1, 1, // 救
    6, 1, 1, //
    5, 1, 6, // 星
};

// code unsigned char joseoninmingungunga[] = {

// 5,2,4,
// 3,2,3,
// 2,2,1,
// 1,2,2,
// 3,2,2,
// 5,2,4,
// 6,2,2,
// 1,3,2,
// 2,3,3,
// 1,3,1,
// 5,2,8,

// 6,2,4,
// 1,3,3,
// 6,2,1,
// 5,2,2,
// 6,2,2,
// 3,2,4,
// 6,2,3,
// 5,2,1,
// 3,2,2,
// 5,2,2,
// 2,2,8,

// 5,2,4,
// 3,2,3,
// 2,2,1,
// 1,2,2,
// 3,2,2,
// 5,2,4,
// 6,2,2,
// 1,3,2,
// 2,3,3,
// 2,3,1,
// 2,3,8,

// 1,3,3,
// 2,3,1,
// 3,3,2,
// 3,3,2,
// 2,3,3,
// 1,3,1,
// 6,2,2,
// 6,2,2,
// 3,2,2,
// 5,2,2,
// 6,2,3,
// 5,2,1,
// 1,3,8,

// 5,2,4,
// 3,3,4,
// 3,3,8,

// 2,3,3,
// 3,3,1,
// 2,3,2,
// 1,3,2,
// 6,2,8,

// 2,3,2,
// 2,3,4,
// 1,3,1,
// 3,3,3,
// 2,3,1,
// 1,3,2,
// 3,3,2,
// 2,3,2,
// 2,3,2,
// 1,3,4,
// 5,2,8,

// 3,2,4,
// 1,3,4,
// 1,3,6,
// 7,2,2,
// 6,2,4,
// 1,3,3,
// 2,3,1,
// 3,3,8,

// 2,3,2,
// 2,3,4,
// 5,2,2,
// 3,3,3,
// 3,3,1,
// 2,3,2,
// 3,3,2,
// 1,3,12,
// 0,2,4,

// };

// code unsigned char vanessa[] = {

// // 5,3,2*3,
// // 1,3,2*3,
// // 3,3,2*3,
// // 5,3,2*3,
// // 4,3,2*3,
// // 6,3,2*3,
// // 7,3,2*3,
// // 1,4,2*3,
// // 5,3,2*3,
// // 7,3,2*3,
// // 1,4,2*3,
// // 2,4,2*3,
// // 3,4,6*3,
// // 0,0,2*3,

// // 3,4,2*3,
// // 1,4,2*3,
// // 5,3,2*3,
// // 3,3,2*3,
// // 4,3,2*3,
// // 5,3,2*3,
// // 6,3,2*3,
// // 7,3,2*3,
// // 5,3,2*3,
// // 7,3,2*3,
// // 3,4,2*3,
// // 2,4,2*3,
// // 3,4,6*3,
// // 0,0,2*3,

// // 5,3,2*3,
// // 1,3,2*3,
// // 3,3,2*3,
// // 5,3,2*3,
// // 4,3,2*3,
// // 6,3,2*3,
// // 7,3,2*3,
// // 1,4,2*3,
// // 5,3,2*3,
// // 7,3,2*3,
// // 1,4,2*3,
// // 2,4,2*3,
// // 3,4,6*3,
// // 0,0,2*3,

// // 3,4,4,
// // 1,4,4,
// // 5,3,4,
// // 1,4,4,
// // 5,3,4,
// // 3,3,4,

// // 4,3,2*3,
// // 5,3,2*3,
// // 6,3,2*3,
// // 7,3,2*3,
// // 5,3,2*3,
// // 7,3,2*3,
// // 3,4,2*3,
// // 2,4,2*3,
// // 1,4,8*3,

// 5,3,2*3,
// 1,3,2*3,
// 3,3,2*3,
// 5,3,2*3,
// 4,3,2*3,
// 6,3,2*3,
// 7,3,2*3,
// 1,4,2*3,
// 5,3,2*3,
// 7,3,2*3,
// 1,4,2*3,
// 2,4,2*3,
// 3,4,6*3,
// 0,0,2*3,

// 3,4,2*3,
// 1,4,2*3,
// 5,3,2*3,
// 3,3,2*3,
// 4,3,2*3,
// 5,3,2*3,
// 6,3,2*3,
// 7,3,2*3,
// 5,3,2*3,
// 7,3,2*3,
// 3,4,2*3,
// 2,4,2*3,
// 3,4,6*3,
// 0,0,2*3,

// 5,3,2*3,
// 1,3,2*3,
// 3,3,2*3,
// 5,3,2*3,
// 4,3,2*3,
// 6,3,2*3,
// 7,3,2*3,
// 1,4,2*3,
// 5,3,2*3,
// 7,3,2*3,
// 1,4,2*3,
// 2,4,2*3,
// 3,4,6*3,
// 0,0,2*3,

// 3,4,4,
// 1,4,4,
// 5,3,4,
// 1,4,4,
// 5,3,4,
// 3,3,4,

// 4,3,2*3,
// 5,3,2*3,
// 6,3,2*3,
// 7,3,2*3,
// 5,3,2*3,
// 7,3,2*3,
// 3,4,2*3,
// 2,4,2*3,
// 1,4,8*3,

// // 5,2,4*3,
// // 3,2,2*3,
// // 5,2,2*3,
// // 1,3,2*3,
// // 7,2,2*3,
// // 6,2,2*3,
// // 5,2,4*3,
// // 1,3,1*3,
// // 6,2,1*3,
// // 5,2,2*3,
// // 3,2,2*3,
// // 6,2,2*3,
// // 5,2,2*3,
// // 3,2,2*3,
// // 4,2,6*3,
// // 2,2,2*3,
// // 4,2,2*3,
// // 6,2,2*3,
// // 5,2,2*3,
// // 2,2,2*3,
// // 3,2,4*3,
// // 1,2,7*3,
// // 0,0,4*3,

// 5,3,4*3,
// 3,3,2*3,
// 5,3,2*3,
// 1,4,2*3,
// 7,3,2*3,
// 6,3,2*3,
// 5,3,4*3,
// 1,4,1*3,
// 6,3,1*3,
// 5,3,2*3,
// 3,3,2*3,
// 6,3,2*3,
// 5,3,2*3,
// 3,3,2*3,
// 4,3,6*3,
// 2,3,2*3,
// 4,3,2*3,
// 6,3,2*3,
// 5,3,2*3,
// 7,2,2*3,
// 1,3,7*3,

// 1,3,2*3,
// 2,3,2*3,
// 3,3,2*3,
// 4,3,2*3,
// 5,3,2*3,
// 6,3,2*3,
// 7,3,2*3,
// 1,4,2*3,
// 1,4,2*3,
// 7,3,2*3,
// 6,3,2*3,
// 5,3,2*3,
// 5,3,2*3,
// 4,3,2*3,
// 3,3,2*3,
// 2,3,2*3,
// };

//--------------------------------------
void t0int() interrupt 1 // T0中断程序，控制发音的音调
{
    TR0 = 0;            // 先关闭T0
    speaker = !speaker; // 输出方波, 发音
    TH0 = timer0h;      // 下次的中断时间, 这个时间, 控制音调高低
    TL0 = timer0l;
    TR0 = 1; // 启动T0
}
//--------------------------------------
void delay(unsigned char t) // 延时程序，控制发音的时间长度
{
    unsigned char t1;
    unsigned long t2;
    for (t1 = 0; t1 < t; t1++) // 双重循环, 共延时t个半拍
        for (t2 = 0; t2 < 4000; t2++)
            ; // 延时期间, 可进入T0中断去发音
    TR0 = 0;  // 关闭T0, 停止发音
}

void ledallon(void)
{
    P0 = 0X00;
    P1 = 0X00;
    P2 = 0X00;
    P3 = P3 & 0XC0;
}
void ledalloff(void)
{
    P0 = 0Xff;
    P1 = 0Xff;
    P2 = 0Xff;
    P3 = P3 | 0X3f;
}
void ledon(unsigned char i)
{
    switch (i)
    {
    case 1:
        P0 = P0 & 0x7f;
        break;
    case 2:
        P0 = P0 & 0xbf;
        break;
    case 3:
        P0 = P0 & 0xdf;
        break;
    case 4:
        P0 = P0 & 0xef;
        break;
    case 5:
        P0 = P0 & 0xf7;
        break;
    case 6:
        P0 = P0 & 0xfb;
        break;
    case 7:
        P0 = P0 & 0xfd;
        break;
    case 8:
        P0 = P0 & 0xfe;
        break; //
    case 9:
        P1 = P1 & 0xfe;
        break;
    case 10:
        P1 = P1 & 0xfd;
        break;
    case 11:
        P1 = P1 & 0xfb;
        break;
    case 12:
        P1 = P1 & 0xf7;
        break;
    case 13:
        P1 = P1 & 0xef;
        break;
    case 14:
        P1 = P1 & 0xdf;
        break;
    case 15:
        P1 = P1 & 0xbf;
        break;
    case 16:
        P1 = P1 & 0x7f;
        break; //
    case 17:
        P3 = P3 & 0xfe;
        break;
    case 18:
        P3 = P3 & 0xfd;
        break;
    case 19:
        P3 = P3 & 0xfb;
        break;
    case 20:
        P3 = P3 & 0xf7;
        break;
    case 21:
        P3 = P3 & 0xef;
        break;
    case 22:
        P3 = P3 & 0xdf;
        break;
    case 23:
        P2 = P2 & 0xfe;
        break;
    case 24:
        P2 = P2 & 0xfd;
        break;
    case 25:
        P2 = P2 & 0xfb;
        break;
    case 26:
        P2 = P2 & 0xf7;
        break;
    case 27:
        P2 = P2 & 0xef;
        break;
    case 28:
        P2 = P2 & 0xdf;
        break;
    case 29:
        P2 = P2 & 0xbf;
        break;
    case 30:
        P2 = P2 & 0x7f;
        break;
    default:
        break;
    }
}
void ledoff(unsigned char i)
{
    switch (i)
    {
    case 1:
        P0 = P0 | 0x80;
        break;
    case 2:
        P0 = P0 | 0x40;
        break;
    case 3:
        P0 = P0 | 0x20;
        break;
    case 4:
        P0 = P0 | 0x10;
        break;
    case 5:
        P0 = P0 | 0x08;
        break;
    case 6:
        P0 = P0 | 0x04;
        break;
    case 7:
        P0 = P0 | 0x02;
        break;
    case 8:
        P0 = P0 | 0x01;
        break; //
    case 9:
        P1 = P1 | 0x01;
        break;
    case 10:
        P1 = P1 | 0x02;
        break;
    case 11:
        P1 = P1 | 0x04;
        break;
    case 12:
        P1 = P1 | 0x08;
        break;
    case 13:
        P1 = P1 | 0x10;
        break;
    case 14:
        P1 = P1 | 0x20;
        break;
    case 15:
        P1 = P1 | 0x40;
        break;
    case 16:
        P1 = P1 | 0x80;
        break; //
    case 17:
        P3 = P3 | 0x01;
        break;
    case 18:
        P3 = P3 | 0x02;
        break;
    case 19:
        P3 = P3 | 0x04;
        break;
    case 20:
        P3 = P3 | 0x08;
        break;
    case 21:
        P3 = P3 | 0x10;
        break;
    case 22:
        P3 = P3 | 0x20;
        break;
    case 23:
        P2 = P2 | 0x01;
        break;
    case 24:
        P2 = P2 | 0x02;
        break;
    case 25:
        P2 = P2 | 0x04;
        break;
    case 26:
        P2 = P2 | 0x08;
        break;
    case 27:
        P2 = P2 | 0x10;
        break;
    case 28:
        P2 = P2 | 0x20;
        break;
    case 29:
        P2 = P2 | 0x40;
        break;
    case 30:
        P2 = P2 | 0x80;
        break;
    default:
        break;
    }
}
void ledpoweron(void)
{
    P3_7 = 0;
}
void ledpoweroff(void)
{
    P3_7 = 1;
}
//--------------------------------------
void song() // 演奏一个音符
{
    TH0 = timer0h; // 控制音调
    TL0 = timer0l;
    TR0 = 1;     // 启动T0, 由T0输出方波去发音
    delay(time); // 控制时间长度
}
//--------------------------------------
void main(void)
{
    unsigned char k, i;
    unsigned int q=1;
    TMOD = 1; // 置T0定时工作方式1
    ET0 = 1;  // 开T0中断
    EA = 1;   // 开CPU中断
    ledpoweroff();
    ledpoweron();
    ledalloff();
    while (1)
    {
        i = 0;
        time = 1;
        while (time)
        {
            ledon(q % 30 + 1);
            k = east_red[i] + 7 * (east_red[i + 1] - 1) - 1;
            // 第i个是音符, 第i+1个是第几个八度
            timer0h = FREQH[k];     // 从数据表中读出频率数值
            timer0l = FREQL[k];     // 实际上, 是定时的时间长度
            time = east_red[i + 2]; // 读出时间长度数值
            if (east_red[i] == 0)
                delay(time); // 如果是休止符, 则延时
            else             // 否则, 发出一个音符
                song();      // 发出一个音符
            i += 3;
            q+=2;
            if (i > sizeof(east_red))
                i = 0;
            ledalloff();
        }
    }
}