//-----------------------------------------------------------------------------//
//---------心率仪语音播报C51程序框架---by tjx----------------------------------//
//---------------------2023.04-------------------------------------------------//
//------------------crystal=6MHz-----------------------------------------------//
//-----------------------------------------------------------------------------//

//-----------------------------------------------------------------------------//
//包含头文件、定义各个接口-----------------------------------------------------//
//-----------------------------------------------------------------------------//
#include <AT89X52.H>
#define  uint  unsigned int  //定义一下方便编程
#define  uchar unsigned char //定义一下方便编程
#define  keystart       P1_0 //定义测量开始启动按钮口
#define  SOUND_RESET    P1_6 //定义语音芯片复位口
#define  SOUND_DATA     P1_5 //定义语音芯片数据口
#define  SOUND_BUSY     P1_4 //定义语音芯片忙碌口
uint     heartrate=123;      //定义心率值变量并赋初值     
uchar    ge,shi,bai;	     //定义个位、十位、百位要显示、播报的数值



//-----------------------------------------------------------------------------//
//函数声明---------------------------------------------------------------------//
//-----------------------------------------------------------------------------//
void delay1ms(uint count);        //毫秒级延时（不是很准）
void sound_reset(void);			  //复位语音芯片
void speek(unsigned char num);	  //播报地址对应的声音
void speekone(void);			  //播报一声“叮”
void speekheartrate(void);	      //播报心率值

//-----------------------------------------------------------------------------//
//主函数，开机报报叮叮咚咚的声音-----------------------------------------------//
//-----------------------------------------------------------------------------//
void main(void)
{ int idx = 0;
	for (idx=0; idx<256;idx++)
	 speek(idx);
	speek(1);                    //开机播报“叮叮咚咚”的声音
    while(1)
	{
//	  if(keystart==0)
//	  {
//	    delay1ms(80);
//		if(keystart==0)
//		{
//		  speekone();
//		  bai=heartrate/100;	     //计算百位数值
//	      shi=(heartrate/10)%10;   //计算十位数值
//	      ge=heartrate%10;		 //计算个位数值
//		  speekheartrate();        //播报心率值（需补全该函数）
//		}	
//	  }
	}
	  
}

//-----------------------------------------------------------------------------//
//延时1ms的函数----------------------------------------------------------------//
//-----------------------------------------------------------------------------//
void delay1ms(uint count)
    { 
     int m,n;
     for(m=0;m<count;m++)
	   for(n=0;n<59;n++)
	   ;
    }
/*以下为语音芯片复位的函数*/
void sound_reset(void)
{
   SOUND_RESET=1;
   delay1ms(2);
   SOUND_RESET=0;
   delay1ms(2);
}
/*以下为播报某个地址声音的函数*/ 
void speek(unsigned char num)
{
  unsigned char i=0;
  while(SOUND_BUSY==0);
  sound_reset();
  if((num>=0)&&(num<=9))
  {
    for(i=0;i<num+2;i++)
    {
      SOUND_DATA=1;
      delay1ms(1);
      SOUND_DATA=0;
	  delay1ms(1);
    }
  }
  else
  {
    for(i=0;i<num;i++)
    {
      SOUND_DATA=1;
      delay1ms(1);
      SOUND_DATA=0;
	  delay1ms(1);
    }
  }
}
/*以下为播报“叮——”的函数*/
void speekone(void)
{
  while(SOUND_BUSY==0);
  speek(33);
}
/*以下为播报心率值的函数*/
void speekheartrate(void)
{
  //后面的自己补全
  //播报百位
  //播报十位
  //播报个位
}
//-----------------------------------------------------------------------------//
//程序完毕---------------------------------------------------------------------//
//-----------------------------------------------------------------------------//

